
&НаСервере
Процедура уз_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	уз_СоздатьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура уз_СоздатьЭлементыФормы()
	
	Форма = ЭтотОбъект;
	
	уз_РаботаСФормами.СоздатьКоманду(Форма, "ЗаполнитьЗадачами", "Заполнить задачами", "ЗаполнитьЗадачами");	уз_РаботаСФормами.СздКнопка(Форма, "ЗаполнитьЗадачами", Элементы.ЗапасыКоманднаяПанельКоманды, "Заполнить задачами", "ЗаполнитьЗадачами", 1);
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗаполнитьЗадачами()

	Сообщить("выааыввыа");
	
КонецПроцедуры