
&НаКлиенте
Процедура СостояниеЗаявкиПриИзменении(Элемент)
	
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.уз_СостоянияЗадачи.Выполнена") Тогда
		Объект.ДатаЗакрытия = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОписаниеФорматированное = ТекущийОбъект.Описание.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Описание = Новый ХранилищеЗначения(ОписаниеФорматированное);
	
КонецПроцедуры
